remove plantuml diagrams
